In [4]:
a = ['이경율','40','167']
b = ['이온유','4','67']
c = ['귀요미','3','40']
d = [a,b,c]

In [3]:
import pandas as pd

In [7]:
e = pd.DataFrame(d)

In [8]:
e.columns=['이름','나이','비고']

In [9]:
e

    이름  나이   비고
0  이경율  40  167
1  이온유   4   67
2  귀요미   3   40

In [10]:
a = ['a01','a02','a03']
b = ['lee','kim','park']
c = [23,34,45]
pd.DataFrame(zip(a,b,c))

     0     1   2
0  a01   lee  23
1  a02   kim  34
2  a03  park  45